#### Terraform Plan

<details><summary>Show Plan</summary>

```
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-1174f72e_S3Object_F1D801A5: Refreshing state... [id=asset.c814122fe98ecb97e55419948afe38bcc26a9ca25b.3078ddbdd04cef38a0f7623d56fcab70.zip]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRole_5F3056C5: Refreshing state... [id=terraform-20230727204725916100000001]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRolePolicyAttachment_4C4C30DD: Refreshing state... [id=terraform-20230727204726141100000002-20230727204726505100000004]
aws_dynamodb_table.VotingAppItems_tfawsdynamodbTableDynamodbTable_21A977CE: Refreshing state... [id=VotingAppItems-0e93c191]
aws_s3_bucket.Code: Refreshing state... [id=code-c84a50b1-20230727202411678600000003]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-1174f72e_4702FFC5: Refreshing state... [id=VotingAppApi-OnRequest-1174f72e-c814122f]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRolePolicy_547443A5: Refreshing state... [id=terraform-20230727204726141100000002:terraform-20230727204739775000000006]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRole_249C1D45: Refreshing state... [id=terraform-20230727204726141100000002]
data.aws_region.Region: Reading...
aws_iam_role.InitializeTable_Function_IamRole_E3F0843D: Refreshing state... [id=terraform-20230727202411672600000001]
data.aws_region.Region: Read complete after 0s [id=us-east-1]
aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19: Refreshing state... [id=terraform-20230727202411672600000001-20230727202411887400000005]
aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519: Refreshing state... [id=terraform-20230727202411672600000001:terraform-20230727202424567600000008]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicyAttachment_E1980EB1: Refreshing state... [id=terraform-20230727204725916100000001-20230727204726450200000003]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E: Refreshing state... [id=terraform-20230727204725916100000001:terraform-20230727204739773400000005]
aws_s3_object.InitializeTable_Function_S3Object_F5933D3B: Refreshing state... [id=asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.f80863316cf31fdb783f689af90dde6d.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9: Refreshing state... [id=asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.13eaeb3a6d1dd3fe6a101f1a7c751cf3.zip]
aws_lambda_function.InitializeTable_Function_FD00736D: Refreshing state... [id=Function-c8e7055b]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289: Refreshing state... [id=VotingAppApi-OnRequest-41f14472-c87bddf9]
aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98: Refreshing state... [id=dfh6uhtoa0]
aws_lambda_permission.VotingAppApi_api_permission-POST-cb38ebcb_8DE7E4D2: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-cb38ebcb]
aws_lambda_permission.VotingAppApi_api_permission-GET-60cabf0c_A106D13D: Refreshing state... [id=AllowExecutionFromAPIGateway-GET-60cabf0c]
aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894: Refreshing state... [id=o1qnwo]
aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA: Refreshing state... [id=ags-dfh6uhtoa0-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cloudWebsite_AllowDistributionReadOnly_89DC4FD0" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894 must be replaced
+/- resource "aws_api_gateway_deployment" "VotingAppApi_api_deployment_B9647894" {
      ~ created_date  = "2023-07-27T20:47:47Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:223316951128:dfh6uhtoa0/" -> (known after apply)
      ~ id            = "o1qnwo" -> (known after apply)
      ~ invoke_url    = "https://dfh6uhtoa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "4067b106aab2d8e9f59b16ff863b180cdb8a650f" -> "3bab94aaf9fbc7c05a803e384ac3c75eab75837f"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98 will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "VotingAppApi_api_CB41EC98" {
      ~ body                         = jsonencode(
            {
              - openapi = "3.0.3"
              - paths   = {
                  - "/items" = {
                      - get = {
                          - operationId                     = "get-items"
                          - parameters                      = []
                          - responses                       = {
                              - "200" = {
                                  - content     = {}
                                  - description = "200 response"
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9/invocations"
                            }
                        }
                    }
                  - "/vote"  = {
                      - post = {
                          - operationId                     = "post-vote"
                          - parameters                      = []
                          - responses                       = {
                              - "200" = {
                                  - content     = {}
                                  - description = "200 response"
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-1174f72e-c814122f/invocations"
                            }
                        }
                    }
                }
            }
        ) -> (known after apply)
        id                           = "dfh6uhtoa0"
        name                         = "api-c8bc2868"
        tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA will be updated in-place
  ~ resource "aws_api_gateway_stage" "VotingAppApi_api_stage_9B2FA9EA" {
      ~ deployment_id         = "o1qnwo" -> (known after apply)
        id                    = "ags-dfh6uhtoa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9 will be created
  + resource "aws_cloudfront_distribution" "cloudWebsite_Distribution_083B5AF9" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "s3Origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "s3Origin"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudfront_origin_access_control.cloudWebsite_CloudfrontOac_C956968B will be created
  + resource "aws_cloudfront_origin_access_control" "cloudWebsite_CloudfrontOac_C956968B" {
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "cloudfront-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRole_249C1D45 will be destroyed
  # (because aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRole_249C1D45 is not in configuration)
  - resource "aws_iam_role" "VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRole_249C1D45" {
      - arn                   = "arn:aws:iam::223316951128:role/terraform-20230727204726141100000002" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-07-27T20:47:26Z" -> null
      - force_detach_policies = false -> null
      - id                    = "terraform-20230727204726141100000002" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "terraform-20230727204726141100000002" -> null
      - name_prefix           = "terraform-" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-07-27T21:03:24Z"
              - region         = "us-east-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATH7V2IBMFUA5G4VIF" -> null

      - inline_policy {
          - name   = "terraform-20230727204739775000000006" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "dynamodb:PutItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:us-east-1:223316951128:table/VotingAppItems-0e93c191",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRole_0FF833EF will be created
  + resource "aws_iam_role" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRole_0FF833EF" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRolePolicy_547443A5 will be destroyed
  # (because aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRolePolicy_547443A5 is not in configuration)
  - resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRolePolicy_547443A5" {
      - id     = "terraform-20230727204726141100000002:terraform-20230727204739775000000006" -> null
      - name   = "terraform-20230727204739775000000006" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-east-1:223316951128:table/VotingAppItems-0e93c191",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "terraform-20230727204726141100000002" -> null
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E will be updated in-place
  ~ resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E" {
        id     = "terraform-20230727204725916100000001:terraform-20230727204739773400000005"
        name   = "terraform-20230727204739773400000005"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "dynamodb:Scan",
                          + "dynamodb:PutItem",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97 will be created
  + resource "aws_iam_role_policy" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-1:223316951128:table/VotingAppItems-0e93c191",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRolePolicyAttachment_4C4C30DD will be destroyed
  # (because aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRolePolicyAttachment_4C4C30DD is not in configuration)
  - resource "aws_iam_role_policy_attachment" "VotingAppApi_VotingAppApi-OnRequest-1174f72e_IamRolePolicyAttachment_4C4C30DD" {
      - id         = "terraform-20230727204726141100000002-20230727204726505100000004" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "terraform-20230727204726141100000002" -> null
    }

  # aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicyAttachment_055C2EDA will be created
  + resource "aws_iam_role_policy_attachment" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicyAttachment_055C2EDA" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be updated in-place
  ~ resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
        id                             = "Function-c8e7055b"
      ~ last_modified                  = "2023-07-27T20:47:45.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:2/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.f80863316cf31fdb783f689af90dde6d.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.1f589876a4352d35a81063667f268bd1.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-1174f72e_4702FFC5 will be destroyed
  # (because aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-1174f72e_4702FFC5 is not in configuration)
  - resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-1174f72e_4702FFC5" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-1174f72e-c814122f" -> null
      - function_name                  = "VotingAppApi-OnRequest-1174f72e-c814122f" -> null
      - handler                        = "index.handler" -> null
      - id                             = "VotingAppApi-OnRequest-1174f72e-c814122f" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-1174f72e-c814122f/invocations" -> null
      - last_modified                  = "2023-07-27T20:47:47.340+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = true -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-1174f72e-c814122f:1" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-1174f72e-c814122f:1/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::223316951128:role/terraform-20230727204726141100000002" -> null
      - runtime                        = "nodejs18.x" -> null
      - s3_bucket                      = "code-c84a50b1-20230727202411678600000003" -> null
      - s3_key                         = "asset.c814122fe98ecb97e55419948afe38bcc26a9ca25b.3078ddbdd04cef38a0f7623d56fcab70.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "XG9/lEOV1asHRSs9SmPWG5QFPshWwVW3pF8eyi+OtqM=" -> null
      - source_code_size               = 162455 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 30 -> null
      - version                        = "1" -> null

      - environment {
          - variables = {
              - "WING_FUNCTION_NAME"         = "VotingAppApi-OnRequest-1174f72e-c814122f"
              - "WING_TARGET"                = "tf-aws"
              - "WING_TOKEN_TFTOKEN_TOKEN_1" = "\"VotingAppItems-0e93c191\""
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289" {
        id                             = "VotingAppApi-OnRequest-41f14472-c87bddf9"
      ~ last_modified                  = "2023-07-27T20:47:47.338+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:1/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.13eaeb3a6d1dd3fe6a101f1a7c751cf3.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.079a9f691c0b432ac1485ae6e073d59e.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52 will be created
  + resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "code-c84a50b1-20230727202411678600000003"
      + s3_key                         = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.80a2f1fbb12ae8ac4f21ee936db23c97.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "WING_FUNCTION_NAME"         = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
              + "WING_TARGET"                = "tf-aws"
              + "WING_TOKEN_TFTOKEN_TOKEN_1" = "\"VotingAppItems-0e93c191\""
            }
        }

      + vpc_config {
          + vpc_id = (known after apply)
        }
    }

  # aws_lambda_permission.VotingAppApi_api_permission-GET-60cabf0c_A106D13D must be replaced
-/+ resource "aws_lambda_permission" "VotingAppApi_api_permission-GET-60cabf0c_A106D13D" {
      ~ function_name       = "VotingAppApi-OnRequest-41f14472-c87bddf9" -> "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway-GET-60cabf0c" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_permission.VotingAppApi_api_permission-POST-cb38ebcb_8DE7E4D2 must be replaced
-/+ resource "aws_lambda_permission" "VotingAppApi_api_permission-POST-cb38ebcb_8DE7E4D2" {
      ~ function_name       = "VotingAppApi-OnRequest-1174f72e-c814122f" -> "VotingAppApi-OnRequest-41f14472-c87bddf9" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway-POST-cb38ebcb" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355 will be created
  + resource "aws_s3_bucket" "cloudWebsite_WebsiteBucket_EB03D355" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "cloud-website-c8e58765-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE will be created
  + resource "aws_s3_bucket_policy" "cloudWebsite_DistributionS3BucketPolicy_32B029AE" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.cloudWebsite_PublicAccessBlock_18A70311 will be created
  + resource "aws_s3_bucket_public_access_block" "cloudWebsite_PublicAccessBlock_18A70311" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.cloudWebsite_Encryption_6A8A4E29 will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "cloudWebsite_Encryption_6A8A4E29" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41 will be created
  + resource "aws_s3_bucket_website_configuration" "cloudWebsite_BucketWebsiteConfiguration_920E8E41" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B must be replaced
-/+ resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1f1a77d39c967126db5ef620392c27e7" -> (known after apply)
      ~ id                     = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.f80863316cf31fdb783f689af90dde6d.zip" -> (known after apply)
      ~ key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.f80863316cf31fdb783f689af90dde6d.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.1f589876a4352d35a81063667f268bd1.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/F80863316CF31FDB783F689AF90DDE6D/archive.zip" -> "assets/InitializeTable_Function_Asset_1A1B5BC3/1F589876A4352D35A81063667F268BD1/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-1174f72e_S3Object_F1D801A5 will be destroyed
  # (because aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-1174f72e_S3Object_F1D801A5 is not in configuration)
  - resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-1174f72e_S3Object_F1D801A5" {
      - acl                    = "private" -> null
      - bucket                 = "code-c84a50b1-20230727202411678600000003" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "binary/octet-stream" -> null
      - etag                   = "a30435b75f82aba9029d869ef4272807" -> null
      - force_destroy          = false -> null
      - id                     = "asset.c814122fe98ecb97e55419948afe38bcc26a9ca25b.3078ddbdd04cef38a0f7623d56fcab70.zip" -> null
      - key                    = "asset.c814122fe98ecb97e55419948afe38bcc26a9ca25b.3078ddbdd04cef38a0f7623d56fcab70.zip" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-1174f72e_Asset_6F97F7C2/3078DDBDD04CEF38A0F7623D56FCAB70/archive.zip" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "632e96483d090f4a70c721fea08f7b62" -> (known after apply)
      ~ id                     = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.13eaeb3a6d1dd3fe6a101f1a7c751cf3.zip" -> (known after apply)
      ~ key                    = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.13eaeb3a6d1dd3fe6a101f1a7c751cf3.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.079a9f691c0b432ac1485ae6e073d59e.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/13EAEB3A6D1DD3FE6A101F1A7C751CF3/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/079A9F691C0B432AC1485AE6E073D59E/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004 will be created
  + resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004" {
      + acl                    = "private"
      + bucket                 = "code-c84a50b1-20230727202411678600000003"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.80a2f1fbb12ae8ac4f21ee936db23c97.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/80A2F1FBB12AE8AC4F21EE936DB23C97/archive.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70 will be created
  + resource "aws_s3_object" "cloudWebsite_File--asset-manifestjson_8187FE70" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/asset-manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/asset-manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--faviconico_A86052F9 will be created
  + resource "aws_s3_object" "cloudWebsite_File--faviconico_A86052F9" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/vnd.microsoft.icon"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C will be created
  + resource "aws_s3_object" "cloudWebsite_File--indexhtml_2A2AE13C" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--logo192png_6E513B20 will be created
  + resource "aws_s3_object" "cloudWebsite_File--logo192png_6E513B20" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/logo192.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/logo192.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3 will be created
  + resource "aws_s3_object" "cloudWebsite_File--logo512png_E26C5AA3" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/logo512.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/logo512.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--manifestjson_5AC33197 will be created
  + resource "aws_s3_object" "cloudWebsite_File--manifestjson_5AC33197" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--robotstxt_F93900E9 will be created
  + resource "aws_s3_object" "cloudWebsite_File--robotstxt_F93900E9" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/robots.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/robots.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--css--maine6c13ad2css_F3967298 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--css--maine6c13ad2css_F3967298" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/css/main.e6c13ad2.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/css/main.e6c13ad2.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--css--maine6c13ad2cssmap_DFBF7C37 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--css--maine6c13ad2cssmap_DFBF7C37" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/css/main.e6c13ad2.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/css/main.e6c13ad2.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/787.28cb0dcd.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/787.28cb0dcd.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/787.28cb0dcd.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/787.28cb0dcd.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjsLICENSEtxt_CF173BC8 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf4c8898cjsLICENSEtxt_CF173BC8" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f4c8898c.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f4c8898c.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjs_7B16084A will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf4c8898cjs_7B16084A" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f4c8898c.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f4c8898c.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjsmap_0538E57B will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--mainf4c8898cjsmap_0538E57B" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.f4c8898c.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.f4c8898c.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File-configjson_591A81BA will be created
  + resource "aws_s3_object" "cloudWebsite_File-configjson_591A81BA" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content                = jsonencode(
            {
              + apiUrl = "https://dfh6uhtoa0.execute-api.us-east-1.amazonaws.com/prod"
            }
        )
      + content_type           = "application/json"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "config.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 32 to add, 5 to change, 10 to destroy.

```

</details>
